print("«Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .»")


w = input("Введите  пропущенное слово:")
l = input("Введите пропущенную букву:")
w1 = input("Введите  пропущенное слово:")
l1 = input("Введите пропущенную букву:")
w2 = input("Введите  пропущенное слово:")
w3 = input("Введите  пропущенное слово:")
l2 = input("Введите пропущенную букву:")


print(f"«Шляпка гриба, покрытая {w} кожиц{l}й, держится на {w1} ножк{l1} . Снизу шляпка затянута {w2} плёнкой. Когда её уберёшь, откроется нижняя {w3} сторона шляпк{l2} .»")





